[
    "To demonstrate the presence of bacteria under fingernails, a fingernail is rubbed gently over the surface of a nutrient agar plate. The plate is then incubated at a warm temperature (about 37°C) for 24 to 48 hours. After incubation, bacterial colonies will appear on the agar where the fingernail was rubbed, indicating bacterial contamination.",
    "Inhalation in humans begins when the diaphragm contracts and moves downward, while the external intercostal muscles contract to raise the rib cage. This increases the volume of the thoracic cavity and decreases the pressure inside the lungs, causing air to be drawn in through the nose or mouth and into the lungs.",
    "Gaseous exchange in the shoot system of flowering plants takes place through microscopic openings on leaves called stomata. These stomata allow carbon dioxide to enter the leaf for photosynthesis and enable oxygen, a by-product of photosynthesis, to diffuse out into the atmosphere.",
    "When mammalian red blood cells are placed in distilled water, osmosis causes water to move into the cells because the surrounding solution is hypotonic. This influx of water leads to swelling and eventually causes the cells to burst, a process known as hemolysis. This experiment demonstrates the effect of osmotic pressure on cell membranes.",
    "The Northern Guinea savanna is a tropical grassland ecosystem characterized by tall, dense grasses and widely scattered trees. It experiences a distinct wet season, usually from May to September, and a dry season from October to April. The climate is warm year-round, and the area supports a variety of grazing animals due to abundant vegetation.",
    "To estimate plant density in a given area, a quadrat—a square frame of known dimensions—is placed randomly within the study area. The number of individual plants of the target species inside the quadrat is counted. Plant density is calculated by dividing the total number of individuals by the area of the quadrat, and this may be repeated across multiple quadrats for accuracy.",
    "Inhalation occurs when the diaphragm contracts and moves downward, and the intercostal muscles pull the rib cage upward and outward. This expansion increases lung volume, causing a drop in pressure that allows air to flow through the airways and into the lungs.",
    "Meiosis is the process by which gametes (sperm and egg cells) are formed, reducing the chromosome number by half to create haploid cells. During fertilization, a male and a female gamete fuse to form a diploid zygote, restoring the full chromosome number. These processes ensure genetic diversity through mechanisms like crossing over and independent assortment.",
    "Distilled water is hypotonic to the cytoplasm of red blood cells. When red blood cells are placed in distilled water, osmosis causes water to enter the cells. As water accumulates, the cells swell and may burst due to the increased internal pressure, a phenomenon called hemolysis.",
    "In the shoot system of flowering plants, stomata play a crucial role in gaseous exchange. These pores open to allow carbon dioxide to enter the leaf for photosynthesis and release oxygen into the air. The opening and closing of stomata are controlled by specialized guard cells that respond to environmental conditions.",
    "The Northern Guinea savanna supports herbivorous animals by providing abundant grasses during the wet season for feeding. Scattered trees offer shade and shelter, especially during the hot dry season. This ecosystem is ideal for livestock grazing and wildlife habitation.",
    "An alternative approach to estimating plant density involves randomly placing several quadrats across the study site. The number of individuals in each quadrat is counted, and the average density is calculated. This method reduces sampling bias and provides a more accurate estimate of plant distribution.",
    "Meiosis promotes genetic variation by producing gametes that carry different combinations of genes. This variation arises from processes such as crossing over during prophase I and the random assortment of chromosomes. Fertilization further enhances diversity by combining genetic material from two parents.",
    "When red blood cells are placed in distilled water, water enters the cells by osmosis due to the hypotonic nature of the surrounding fluid. Initially, the cells swell as they absorb water. If this continues, the membrane cannot withstand the pressure, and the cells may burst in a process called hemolysis.",
    "Stomata are specialized structures in the leaves of plants that regulate gas exchange. They open to allow the entry of carbon dioxide needed for photosynthesis and release oxygen into the air. The size of the stomatal opening is controlled by guard cells, which respond to environmental cues such as light, humidity, and carbon dioxide levels.",
    "The Northern Guinea savanna experiences a tropical climate with distinct seasonal variation. The wet season lasts from approximately May to September, bringing heavy rainfall that supports plant growth. The dry season follows from October to April, marked by little to no rainfall and higher temperatures.",
    "Fertilization is a biological process where a male gamete (sperm) fuses with a female gamete (egg) to form a zygote. This restores the diploid chromosome number and combines genetic material from both parents, which is crucial for the development of genetically diverse offspring.",
    "Red blood cells placed in distilled water undergo osmotic lysis because water moves into the cells due to the hypotonic environment. The cells swell and may rupture when the cell membrane can no longer contain the internal pressure, illustrating the importance of osmotic balance in cells.",
    "Stomata are tiny pores on the surface of leaves that facilitate gaseous exchange. Their opening and closing are regulated by guard cells, which respond to environmental signals such as light and humidity. This regulation ensures that the plant takes in carbon dioxide for photosynthesis and releases oxygen efficiently while minimizing water loss.",
    "The Northern Guinea savanna serves as a vital ecosystem that supports a diverse range of plant and animal species. It provides food and shelter for herbivores and predators alike. The region also helps maintain ecological balance by supporting biodiversity and enabling nutrient cycling through its grassland and tree components."
  ]

